/**
 * 统一错误代码定义
 */
export const ErrorCodeMap = {
	// 10000 - 99999 业务操作错误
	10000: '参数校验异常',
	10001: '用户已存在',
	10002: '填写验证码有误',
	10003: '用户名密码有误',
	10005: '密码校验失败',
	10006: '旧密码与原密码不一致',
	10008: '系统内置功能不允许操作',
	10009: '用户不存在',

	// token相关
	11001: '登录无效或无权限访问',
	11002: '登录身份已过期',
	11003: '无权限，请联系管理员申请权限',
	11004: '登录期间已更改过密码, 请重新登录',

	// OSS相关
	20001: '当前创建的文件或目录已存在',
	20002: '无需操作',
	20003: '已超出支持的最大处理数量',

	99998: '数据对比异常',
	99999: '系统错误'
} as const

export type ErrorCodeMapType = keyof typeof ErrorCodeMap
